[{"_path":"/modules/software-development-handson/excercises-code-carbon-r","_dir":"software-development-handson","_draft":false,"_partial":false,"_locale":"","title":"Code Carbon in R","description":"","type":"exercise","order":6,"_type":"markdown","_id":"local_fs:modules:software-development-handson:excercises-code-carbon-r.md","_source":"local_fs","_file":"modules/software-development-handson/excercises-code-carbon-r.md","_stem":"modules/software-development-handson/excercises-code-carbon-r","_extension":"md","plainText":"---\ntitle: \"Code Carbon in R\"\ntype: exercise\norder: 6\n---\n\n# CodeCarbon in R\n\n## Introduction\n---------------\n\nIf you are mainly coding in R, you may want to learn more about the impact of your R code in terms of energy consumption and carbon footprint. However, there aren't yet as of now R packages that allow to do this in a reliable and user-friendly way. One promising tool is the [**RJoules package**](https://rishalab.github.io/RJoules/); however, it is still in development and restricted to certain operating systems used by developers (i.e., linux).\n\n**CodeCarbon** is a Python package that estimates the carbon footprint of code. You can [read more about it here](https://mlco2.github.io/codecarbon/). This Python module is well documented and easy to use. How sad that it is only available for Python... But there is a way to use it in R! In fact, it is possible and relatively easy to run Python in RStudio. This can be done through the [`reticulate`](https://rstudio.github.io/reticulate/) package, which allows you to run Python code from R directly into your R script. For more complex workflows, [**Quarto**](https://quarto.org/docs/computations/python.html) can be used to combine R and Python code in the same document. In fact, Quarto markdown files (.qmd) are exceptionally good at calling R and Python code in the same document, whilst also making it explicit what code belongs to each, using the native syntax for both languages in the same document and analysis workflow.\n\nThis tutorial shows how to implement CodeCarbon in R through RStudio. An example workflow is provided by measuring the carbon footprint of two different R packages used to fit mixed-effects models. Additionally, time-varying confounding is introduced into the built-in R `ChickWeight` data through simulation to compare how different statistical modelling strategies to account for confounding compare in terms of their energy consumption and carbon footprint.\n\n## Installation\n---------------\n\nThe detailed instructions for installation of Python and CodeCarbon are found in the [prior lesson](https://esciencecenter-digital-skills.github.io/green-digital-skills/modules/software-development-handson/exercises_codecarbon). It is assumed that you have already followed these steps.\n\nIf you have not done so, [install R and RStudio](https://posit.co/download/rstudio-desktop/). Note that these demonstrations were conducted under R version 4.4.0 and RStudio 2024.04.0, so it is recommended that you install these or more recent versions.\n\nLastly, all the necessary materials and R scripts for this tutorial can be downloaded from Zenodo (doi: [10.5281/zenodo.14617645](https://doi.org/10.5281/zenodo.14617645)). You can also download the ZIP file by [following this link](https://zenodo.org/records/14617645/files/UtrechtUniversity/code-carbon-r-v1.0.0.zip?download=1), unpack it, and place it in a familiar folder in your computer. \n\n## Calling CodeCarbon in an R script\n-------------------------------------\n\nYou will found a sample R script named **code-carbon-script.R** inside the *R folder* if you successfully downloaded the material with the prior steps. This script can be adapted to test your own R code. It incorporates the following steps:\n\nFirst, you will need to install the `reticulate` package and load it into your session:\n\n```         \ninstall.packages(\"reticulate\")\nlibrary(reticulate)\n```\n\nLoad the CodeCarbon module using the reticulate [`import`](https://rstudio.github.io/reticulate/reference/import.html) function.\n\n```         \ncodecarbon <- import(\"codecarbon\")\n```\n\nImport the OfflineEmissionsTracker class\n\n```         \nOfflineEmissionsTracker <- codecarbon$OfflineEmissionsTracker\n```\n\nSet the emissions trackers parameter and initialize. This will automatically detect your system's characteristics and open a file to save the report later on. You can also specify the country code, timing of measurements, among others. See the [CodeCarbon documentation](https://mlco2.github.io/codecarbon/parameters.html#id6) for more details:\n\n```         \ntracker <- OfflineEmissionsTracker(\n  country_iso_code = \"NLD\",\n  measure_power_secs = 5\n)\n```\n\nStart tracking the emissions, run your code, and finish tracking once your code ran.\n\n```         \ntracker$start()\n\n# Your R code here\n\ntracker$stop()\n```\n\nThis will terminate the report and save it in your default working directory, unless you specified earlier the path to save it according to the provided documentation.\n\nNote that CodeCarbon will continue to track until you explicitly stop it with `tracker$stop()`. Thus, you may want to run all lines of code from start -\\> code -\\> stop in one go to measure the consumption of that specific code.\n\n## Calling CodeCarbon in a Quarto markdown (qmd) file in RStudio\n----------------------------------------------------------------\n\nIf you use Quarto, you can call Python and R code in the same document, using their native syntax. For this, you can specify the language of the code block using the `python` or `r` tags:\n\n\n```\n{python}\n# Your python code here\n``` \n\n```\n{r}\n# Your R code here\n```\n\nThe advantage of using Quarto is that you don't need to rewrite python code using the `reticulate` syntax. You can simply copy and paste the Python code into the `python` code block. This is a great advantage when you are not very familiar with Python and you want to reuse well-documented native python code, or simply to efficiently communicate with Python programmers.\n\nBecause Rstudio loads the reticulate package once it reads the `python` tag, you don't need to load the `reticulate` package in the code block. Thus, we will start by calling the CodeCarbon module in Python.\n\n### Setup \n\nIn the downloaded folder, you will find an R project icon named **code-carbon-R.Rproj**. Open this project in RStudio. This will set a default working directory, which is useful to read the associated scripts and save the emissions reports. Now, navigate to the **R** folder, where you will find a document called **code-carbon-Quarto.qmd**. You may open this file in RStudio to reproduce the following steps in the corresponding section. \n\n> *Tip: The rest of this tutorial can be followed through the code-carbon-Quarto.qmd file in RStudio.*\n\n### Instructions  \n\nStart by pressing the play button below that reads \"Run Current Chunk\":\n\n```\n{python}\n# Load the CodeCarbon module\nfrom codecarbon import OfflineEmissionsTracker\n```\n\nThen, we will initialize the tracker and start tracking the emissions. Beware that you will need to stop tracking the emissions before with the code that will appear later on in this document to start a new tracker. For this, we can use a safety check to avoid running multiple trackers at the same time.\n\n```\n{python}\ntracker = OfflineEmissionsTracker(country_iso_code=\"NLD\",\n                                 measure_power_secs=5)\n\nif getattr(tracker, \"_start_time\", None) is not None:\n    print(\"Warning: Tracker is already running! Did you forget to stop it?\")\nelse:\n    tracker.start()\n    print(\"Tracker started successfully.\")\n```\n\nYou can now change to R language by using the `r` tag. In this code block, you can introduce your R code. For example, a fictitious computationally intensive function for which you would like to test its energy consumption.\n\n``` \n{r}\nintense_computation(large_dataset)\n```\n\nFinally, you can stop tracking the emissions and print the results. You will again find the report as a csv file in your default working directory.\n\n\n```\n{python}\nemissions: float = tracker.stop()\nprint(f\"Emissions tracked: {emissions} kg CO₂e\")\n```\n\nThis value represents the estimated carbon emissions equivalent in kilograms.\n\nCombining R and Python code in a .qmd file will work best if you are rendering your document to any of the output report files implemented in Quarto (i.e., PDF, html, docx, slides, etc). This is because code blocks are executed in the order they are found in the document. However, if you mainly work with R scripts, running CodeCarbon with the `reticulate` package in R will be the best approach.\n\nFor the last part of this tutorial, a hybrid approach is used where:\n1.  Individual R scripts are adapted from the sample **code-carbon-script.R** to include CodeCarbon tracking for every individual task.  \n2.  The individual R scripts are then sourced into the Quarto document to demonstrate the energy consumption and carbon footprint of different R packages used to fit mixed-effects models.  \n3.  This model workflow produces an individual output report for every R script and task, which will be found in the `emissions` folder. \n\nThis approach offers the advantage of more precise measurements because every script starts with the initialization of the tracker and ends with the stop command in one go.\n\n## Demonstration\n----------------\n\nWe will compare two R packages commonly used to fit mixed-effects models that are often compared due to their computational speed. `lme4` is suitable for generalized linear mixed models, runs in C++, and is optimized for speed,<sup>1</sup> whereas `nlme` can additionally fit non-linear models, but is written in R language (before: S and S-Plus)<sup>2</sup> which makes computations somewhat slower and with a potentially higher carbon footprint.\n\nHowever, there are often preliminary modelling steps needed when trying to elucidate the main effects with these two packages. One example is time varying confounding, for which different modelling approaches have been proposed. Inverse probability weighting (IPW) is a powerful tool for such analyses, but many different models can be used to obtain inverse probability weights to be used in the main mixed-effects models. Generalized linear models can be used as a fast an computationally efficient option to obtain IPW through the built-in `stats` R package, which is written in R and C language, but is highly susceptible to incorrect model specification. Novel non-parametric methods are robust to model misspecification,<sup>3</sup> and are implemented in the `CBPS` package, which despite running in C++ for computational efficiency, uses intensive and lengthy calculations. These two methods will be compared using Python `CodeCarbon`. We will use the `WeightIt` package written in R language,<sup>4</sup> which has implemented these two methods and many others which can similarly be tested and compared in terms of energy consumption and carbon footprint.\n\nWe will use the built-in R `ChickWeight` dataset to simulate new data with time-varying treatment-outcome confounding to study the effect of 4 different diets on weight, by accounting for the confounding effect of a time-varying binary disease 1, and an ordinal disease 2, which disease status may also vary in time.\n\nFirst, install and load all the necessary R packages to avoid these one-time installations being tracked by CodeCarbon. The `pacman` package nicely handles installation and loading.\n\n``` {.r .cell-code}\nif (!require(\"pacman\", quietly = TRUE)) {\n  install.packages(\"pacman\")\n}\n\npacman::p_load(\n  tidyverse,        # Used for basic data handling and visualization.\n  conflicted,       # Used to handle conflicts between packages.\n  reticulate,       # Used to call Python code in R.\n  lme4,             # Used to fit linear mixed-effects models.\n  nlme,             # Used to fit non-linear mixed-effects models.\n  WeightIt,         # Used to obtain inverse probability weights (IPW).\n  CBPS              # Used to obtain non-parametric CBPS IPW.\n)\n\nconflicts_prefer(dplyr::select, dplyr::lag, dplyr::filter)\n```\n\n\nWe now simulate the data and measure the time required to complete and it's carbon footprint. The input and output parameters have been adapted in the R script to save the output file in the `emissions` folder. By running this chunk of code, you will also see the live emissions tracking as R console output.\n\n> Important! If the code is interrupted before finishing, emissions will keep to be tracked and shown until you stop it by running the last line in the scripts. This is important to keep in mind when running new code chunks and start a new tracker. Run tracker\\$stop() whenever your code is prematurely interrupted before reaching the end of the script.\n\nTip: If any of the scripts take too long to run, you can try modifying the `sample_size` parameter in the **data_simulation.R** script. This will also be changed below in this code file to explore emissions with different sample sizes.\n\n``` {.r .cell-code}\nsource(\"data-simulation.R\")\n```\n\nLet's now measure the energy consumption of obtaining inverse probability weights with a generalized linear model (glm) in the built-in `stats` R package.\n\n\n``` {.r .cell-code}\nsource(\"ipw_glm.R\")\n```\n\n\nAnd compare against the novel non-parametric method implemented in the `CBPS` package. This will take longer to run than the prior steps, so we will track emissions every 5 seconds.\n\n``` {.r .cell-code}\nsource(\"ipw_CBPS.R\")\n```\n\n> Question: Would you prefer the faster glm method or the more robust CBPS method to obtain IPW? \n\nFinally, we will fit the mixed-effects models with the `lme4` and `nlme` packages, and compare their energy consumption.\n\n``` {.r .cell-code}\nsource(\"mixed_model_lme4.R\")\n```\n\n``` {.r .cell-code}\nsource(\"mixed_model_nlme.R\")\n```\n\n### Simulation with a larger dataset\n\n\nThe original tests used 550 observations in a total of 50 chicks. This was sufficient to demonstrate the differences in emissions with the two IPW methods, but not with the different mixed-effects packages. We will next simulate a much larger dataset with 5000 chicks to be able to compare `lme4` and `nlme`.\n\n\n``` {.r .cell-code}\n# Simulate new data and prepare the dataset for analysis \n\nsimulated_data <- simulate_chickweight(n_chicks = 5000)\n\nanalysis_data <- simulated_data %>%\n  arrange(Chick, Time) %>%\n  group_by(Chick) %>%\n  mutate(\n    lag_disease_1 = lag(disease_1),\n    lag_disease_2 = lag(disease_2),\n    lag_weight = lag(weight)\n  ) %>%\n  ungroup()\n\nanalysis_data <- analysis_data %>%\n  filter(!is.na(lag_disease_1))\n```\n\n\nWe will use the IPW obtained with glm for faster computations.\n\n\n``` {.r .cell-code}\nsource(\"ipw_glm.R\")\n```\n\nAnd now we can compare the energy consumption of fitting the exact same model with the `lme4` and `nlme`.\n\n\n``` {.r .cell-code}\nsource(\"mixed_model_lme4.R\")\n```\n\n``` {.r .cell-code}\nsource(\"mixed_model_nlme.R\")\n```\n\n> Question: How do the energy consumption and carbon footprint of the two packages compare with the larger dataset when fitting the same model? \n\n## Conclusions\n---------------\n\nThis tutorial provides different alternatives to implement CodeCarbon in R workflows. The provided code can be adapted and used by R code developers and other R users to test the efficiency and carbon footprint of their code. Existing R packages able to perform the same tasks can be compared in terms of energy consumption, which can be an additional criterion to choose between them. However, it should be kept in mind that energy consumption an carbon footprint are among the many factors to consider when choosing between different packages. For instance, it could be justifiable to use a method that consumes more energy and has a higher carbon footprint if it offers other significant advantages. \n\n\n## References \n---------------\n\n1.  Bates, Douglas, Martin Mächler, Ben Bolker, and Steve Walker. 2015. “Fitting Linear Mixed-Effects Models Using Lme4.” Journal of Statistical Software 67 (1). https://doi.org/10.18637/jss.v067.i01.\n\n2.  Fong, Christian, Chad Hazlett, and Kosuke Imai. 2018. “Covariate Balancing Propensity Score for a Continuous Treatment: Application to the Efficacy of Political Advertisements.” The Annals of Applied Statistics 12 (1). https://doi.org/10.1214/17-aoas1101.\n\n3.  Greifer, Noah. 2017. “WeightIt: Weighting for Covariate Balance in Observational Studies.” The R Foundation. https://doi.org/10.32614/cran.package.weightit.\n\n4.  Pinheiro, José C., and Douglas M. Bates. 2000. Mixed-Effects Models in s and s-PLUS. New York: Springer. https://doi.org/10.1007/b98882."},{"_path":"/modules/software-development-handson/exercises_codecarbon","_dir":"software-development-handson","_draft":false,"_partial":false,"_locale":"","title":"Code Carbon","description":"","type":"exercise","order":5,"_type":"markdown","_id":"local_fs:modules:software-development-handson:exercises_codecarbon.md","_source":"local_fs","_file":"modules/software-development-handson/exercises_codecarbon.md","_stem":"modules/software-development-handson/exercises_codecarbon","_extension":"md","plainText":"---\ntitle: \"Code Carbon\"\ntype: exercise\norder: 5\n---\n\n# CodeCarbon\n\n## Introduction\n---------------\n\nAn important step in trying to improve the energy efficiency of your\nsoftware is to measure the actual energy consumed during the execution\nof your code.\n\nThere are a handful of open-source software packages available online\nto measure the energy consumption of a piece of code, including \n[PowerAPI](https://github.com/powerapi-ng/powerapi),\n[EnergyMon](https://github.com/energymon/energymon) or\n[PMT](https://git.astron.nl/RD/pmt). In this hands-on exercice, we \nwill focus on [CodeCarbon](https://codecarbon.io/), a Python package\nreadily available on Linux, Windows and MacOS.\n\nWe will start by testing CodeCarbon on a simple example\ncode provided below, then provide guidance on how to test a snippet\nof your own code. For the later, we advise selecting a well-contained, single-purpose\nfunction at first and progressively extend to larger and more complex\nworkflows. The runtime of your selected function/program should be\nof the order of ~10s since CodeCarbon is not designed for high frequency\nmeasurments.\n\n### Prerequisite\n\n - a working knowledge of Python. See [Python Carpentries](https://swcarpentry.github.io/python-novice-inflammation/index.html) for a quick introduction.\n\n## Installing CodeCarbon\n------------------------\n\nCode Carbon is written in Python and brings a number of dependencies.\nIt is recommended to setup a dedicated environment using a package\nand environment management tool such as [Conda](https://docs.conda.io/projects/conda/en/latest/user-guide/getting-started.html) to avoid disrupting the packages currently available\non your computer. However, this step is not mandatory.\n\n### On MacOS and Linux:\n\n#### Using Conda:\n\nCreate a new Conda environment:\n```\nconda create -n greencomputing python=3.12 \n```\n\nActivate the new environment:\n```\nconda activate greencomputing\n```\n\nUse the package manager 'pip' to get CodeCarbon (and its dependencies):\n```\npip install codecarbon\n```\n\n#### Without environment manager:\n\nIn this case, we assume that Python is already available on your computer.\n```\npython -m pip install codecarbon\n```\n\nTo check that CodeCarbon is effectively installed, try the following command:\n```\npython -c \"from codecarbon import OfflineEmissionsTracker; print('SUCCESS')\"\n```\nIf CodeCarbon was successfully installed, the command will simply return 'SUCCESS'.\n\n\n### On Windows\n\nThe above installation instructions should work on Windows if using [WSL](https://learn.microsoft.com/en-us/windows/wsl/install).\n\nIf not, it is generally easiest to install python packages using conda which can be installed according to [these instructions](https://docs.conda.io/projects/conda/en/latest/user-guide/install/windows.html).\n\nIf you have another setup or requirements then please ask - we will do our best to help you get set up!\n\n\n## Using CodeCarbon: a first example\n------------------------------------\n\nThe test case consists in computing the Euclidian distance\nbetween all the points contained in a list, where each point is defined by\ntwo coordinates. To illustrate how changes to the code can impact the energy consumption,\ntwo implementations of the computation are provided: a naive version\nrelying on Python's list and a version using Numpy. The code can\nbe obtained [here](media/EuclidianDistance.py).\n\nLet's now write a small Python driver to execute the computation\nand measure the energy consumption.\n\nWe will start by importing the Python modules needed. In a new\npython file (e.g. EDCodeCarbonTest.py), write the following:\n```python [EDCodeCarbonTest.py]{4-6,7} meta-info=val\nimport random\nimport numpy as np\nfrom EuclidianDistance import get_distances\nfrom codecarbon import OfflineEmissionsTracker \n```\n\nThe first two modules are needed in order to generate data. From the\ncode provided above, we will use the ```get_distances``` function, and\nfinally we will use CodeCarbon's ```OfflineEmissionsTracker```.\nNote that CodeCarbon can also be used ```Online```, allowing live access to\ncarbon intensity data and a dashboard, but the setup is more complicated.\n\nOnce the modules are loaded, we can write the main function of our program,\nappending to the file created above:\n```\nif __name__ == \"__main__\":\n    # Prepare a list of coordinates\n    # Define the list length\n    n_npts = 20000\n\n    # Get Numpy's random number generator with a fixed seed\n    rng = np.random.default_rng(12345)\n\n    # Populate the list, with coordinates uniformly sampled\n    # in the [0,1] interval.\n    points = []\n    for _ in range(n_npts):\n        points.append((rng.uniform(0.0, 1.0), rng.uniform(0.0, 1.0)))\n```\n\nWe now have a list of points to pass to the ```get_distances``` function.\nBut we first need to initialize CodeCarbon emission tracker. In this example,\nwe will use a context manager such as:\n```\n    with OfflineEmissionsTracker(country_iso_code=\"NLD\",\n                                 measure_power_secs=5) as tracker:\n        >> compute intensive code ...\n```\nwhere the ```tracker``` will directly start and report energy consumption as\nwe execute the code. There are numerous runtime options available when\ninitializing the ```OfflineEmissionsTracker```, refers to CodeCarbon\n[documentation](https://mlco2.github.io/codecarbon/parameters.html) for a complete\noverview. In the example above we only provided the Netherlands ISO 3 letters code,\nand the interval (in seconds) to measure hardware power usage.\nLet's now add our actual computation in the code as follows:\n```\n    with OfflineEmissionsTracker(country_iso_code=\"NLD\",\n                                 measure_power_secs=5) as tracker:\n        get_distances(points, \"base\")\n```\nwhere we use the base implementation of the Euclidean distance calculation. It is now\ntime to run the program.\n\n> `Note`{style=\"color: darkred;\"}: On MacOS, CodeCarbon relies on PowerMetrics to access hardware power data, thus requiring root/sudo access. You will be prompted for your login password\n\n\nThe actual output of running the Python program will depend on your platform and hardware,\nbut it will resemble the following (here on MacOS):\n```\n[...] [setup] RAM Tracking...\n[...] [setup] GPU Tracking...\n[...] No GPU found.\n[...] [setup] CPU Tracking...\n[...] Tracking Apple CPU and GPU via PowerMetrics\n[...] >>> Tracker's metadata:\n[...]   Platform system: macOS-14.6.1-arm64-arm-64bit\n[...]   Python version: 3.12.7\n[...]   CodeCarbon version: 2.7.1\n[...]   Available RAM : 24.000 GB\n[...]   CPU count: 8\n[...]   CPU model: Apple M2\n[...]   GPU count: 1\n[...]   GPU model: Apple M2\n[...] Saving emissions data to file ./NLeSC/Training/CodeCarbon/emissions.csv\n[...] Energy consumed for RAM : 0.000013 kWh. RAM Power : 9.000000000000002 W\n[...] Energy consumed for all CPUs : 0.000010 kWh. Total CPU Power : 7.500399999999999 W\n[...] Energy consumed for all GPUs : 0.000000 kWh. Total GPU Power : 0.001 W\n[...] Energy consumed for RAM : 0.000038 kWh. RAM Power : 9.000000000000002 W\n[...] 0.000048 kWh of electricity used since the beginning.\n[...] Energy consumed for all CPUs : 0.000033 kWh. Total CPU Power : 8.2367 W\n[...] Energy consumed for all GPUs : 0.000000 kWh. Total GPU Power : 0.002 W\n[...] Energy consumed for RAM : 0.000048 kWh. RAM Power : 9.000000000000002 W\n[...] ...\n[...] 0.000321 kWh of electricity used since the beginning.\n[...] 0.000890 g.CO2eq/s mean an estimation of 28.064960638276645 kg.CO2eq/year\n```\n\n> `Note`{style=\"color: darkred;\"}: If the CPU on your system is not recognized by CodeCarbon, a default CPU will be used but the code will issue Warnings.\n\nAt time interval specified when initializing the ```OfflineEmissionsTracker```, power and energy\nare reported for the various hardware. Based on the country code provided, an estimate of\nthe CO2eq emission rate is also reported at the end. As you can see, a constant 9W power is used for the RAM here, whereas\nsmall fluctuations are observed on the CPU side. Even though the RAM and CPU are shared with other programs running\non your computer, CodeCarbon assign their full usage to the measured code. A more accurate measurement of the specific\nprocess CPU usage can be obtained by providing an extra argument to the tracker initialization, ```tracking_mode = \"process\"```.\nHowever, this method does not provide a good measurement of the memory power.\n\nLet's now switch to the Numpy version of program by updating the call to the ```get_distances``` function:\n```\n        get_distances(points, \"numpy\")\n```\nAnd re-run the program. The measured energy consumption for thid case is 0.000194 kWh, for an estimated\nemission rate of 0.000538 g.CO2eq/s.\nThis small example demonstrate how by relying on a more efficient implementation, the energy consumption and associated\nemissions can be reduced, mostly due to a shorter runtime. Feel free to experiment with the following:\n - changing problem size\n - update the parameters of the ```OfflineEmissionsTracker```, changing the country code for instance\n - try an alternative implementation of the distance computation\n - add timers to the script to estimate if the average power, is it changing between the two provided implementation ?\n\n## Using CodeCarbon: your own code\n----------------------------------\nIf your target code is based on Python, the simplest way to adapt the small example provided above to\nyour case is wrap your entire program into a single function call and replace the ```get_distances``` function\nby your own.\n\nAn alternate solution, applicable to softwares written in other programming language such as R or C++, is to\nrely on Python subprocess. In the following, let's assume that you have an executable R file (i.e.\nwith ```#! /usr/bin/Rscript``` on the first line).\n\nCreate a new python file (e.g. CodeCarbonWrap.py), with the following imports:\n```\nimport subprocess\nfrom codecarbon import OfflineEmissionsTracker\n```\nand the following main function:\n\n```\nif __name__ == \"__main__\":\n    with OfflineEmissionsTracker(country_iso_code=\"NLD\",\n                                 measure_power_secs=5) as tracker:                                                                                 \n        subprocess.call ([\"/usr/bin/Rscript\", \"--vanilla\", \"/pathto/MyrScript.r\"])\n```\nNote that because the script R script is executed in an external process, the option ```tracking_mode = \"process\"```\nis no longer adapted and only the mode where the CPU usage of the entire computer is measured is relevant. You\nshould thus be aware of the other programs running on your computer (e.g. a web brower with video streaming) as their\nCPU usage will be measured as well, and for more accurate measurements those programs should be terminated.\n\nFor a full tutorial of the use of CodeCarbon in R workflows, please refer to the next lesson.\n\n## Conclusion\n-------------\n\nIn this short tutorial, you have tested first-hand how to measure the energy consumption of a piece of code\nusing [CodeCarbon](https://codecarbon.io/). CodeCarbon can be deployed on larger application as well as\non HPC platforms.\nAlthough written in Python, CodeCarbon can be used for any other languages as long as you are able to use\nPython subprocess to execute the external program (i.e. R, C++, Fortran, ...).\n"}]