[{"_path":"/modules/energy-budget/exercises_module1","_dir":"energy-budget","_draft":false,"_partial":false,"_locale":"","title":"Exercises","description":"Add here your exercises...","type":"exercise","order":2,"_type":"markdown","_id":"local_fs:modules:energy-budget:exercises_module1.md","_source":"local_fs","_file":"modules/energy-budget/exercises_module1.md","_extension":"md","plainText":"---\ntitle: Exercises\ntype: exercise\norder: 2\n---\n\n# Exercises\n\nAdd here your exercises..."},{"_path":"/modules/energy-budget/green-algorithms-digest","_dir":"energy-budget","_draft":false,"_partial":false,"_locale":"","title":"Green Algorithms","description":"===","type":"slides","order":2,"_type":"markdown","_id":"local_fs:modules:energy-budget:green-algorithms-digest.md","_source":"local_fs","_file":"modules/energy-budget/green-algorithms-digest.md","_extension":"md","plainText":"---\ntitle: Green Algorithms\ntype: slides\norder: 2\n---\n\n<!-- .slide: data-state=\"title\" -->\n\n# Digest of Code for Thought podcast into rough slides\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Green Algorithms\n- Loïc Lannelongue started a project called Green Algorithms\n- Made a calculator to estimate energy cost and carbon footprint of your algorithm\n- Necessary for assessing how to make computing more environmentally sustainable\n- Overall they estimate that the carbon footprint of data centres anually is around 100 MT of CO2 equivalent. That is the same as the entire US aviation in the same time.\n- Not all these data centres are doing HPC\n- About 500 Tonnes of CO2 estimated for training GPT3. IPC says we should aim for 2 tonnes of CO2 per person per year to keep global warming in check. \n- Not every model has such huge impacts, but we need to be mindful\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## The GREENER framework\n- We want a set of principles for green computing: GREENER\n- Similar to the FAIR principles for data\n- Governance\n- Responsibility\n- Estimations: Use calculators to estimate impact of the computing\n- New collaboration\n- Education: Need to include the notion that it has a carbon footprint during training of new researchers\n- Research: Still don't know a lot about computing power usage\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Extreme differences between countries\n- Countries with very low carbon intensity: 20g per kWh\n- Countries with high carbon intensity (e.g. Australia): 700g per kWh\n- You can make a big difference by running the exact same thing on the same hardware, but in a different country\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Data centres\n- Power Usage Effectiveness (PUE)\n- Quantifies overhead. Gives you e.g. how much cooling power you need per unit of compute\n- Best data centres are now down to about 10% extra for cooling. Used to be around 100%.\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## What should we aim for?\n- It's the same as with money, we need to think of cost-benefit\n- It depends what you do with it\n- If people can make a case for why they need a lot of money, they should be able to make the case for their large carbon footprint\n- Problem is, in research, the energy cost is effectively decoupled from the cost\n- If a project is cheap financially, but has a large carbon cost, there should be an explicit justification why\n- Want to be energy proportionate - there should be a reasonable assumption their benefits are going to outweigh the environmental costs\n- What about the extra red tape we don't want for researchers? All applications must estimate the environmental impact of their models. They did this in France and researchers still applied. The Green Algorithms Calculator was required to be used for the applications. Researchers accepted it was a fair request and still continued applying.\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## The online calculator\n\n- The idea of the online green algorithms calculator is to make it quick and easy\n- Also a Green Algorithms for HPC tool\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Does it matter what language you use?\n- Paper ranked C++ and Rust at the top, things like python at the bottom\n- Depends how you use it\n- However, if you do ML in Python you're not actually using python. Under the surface, it's basically c++ or something like it\n- Yes, the language matters, but most important is that the tools we are using are as efficient as possible, because they will be used so much (your own analysis scripts probably don't matter so much)\n- Don't have enough RSEs to do all the coding and optimizations\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## How can you make your code more efficient?\n- Depends on the resources you use, how many cpu cores are you using etc\n- Carbon footprint of memory is interesting - it doesn't matter how much you use, but how much is available. Don't request 10 times the memory you need on a server \"just in case\"\n- Think about WHEN we run a job on a server. Energy mix different at different times.\n- Can use tools to forecast the Carbon Aware Task Scheduler - tells you what is the best time to run in the next 48 hours.\n- Most jobs have some flexibility - we don't care if we run it right now or in a few hours. Especially over the weekend.\n\nNote:\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\nwww.esciencecenter.nl\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"}]